rocksdb/experiments/M2/results/20260429-025838/budget_off/run_2/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 03:14:14 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777432454777003 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       8.494 micros/op 117727 ops/sec 42.471 seconds 5000000 operations;  116.8 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      15.371 micros/op 65056 ops/sec 76.856 seconds 5000000 operations;   64.5 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      12.902 micros/op 77504 ops/sec 64.512 seconds 5000000 operations;   76.9 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     16/15  996.45 MB   0.2      0.0     0.0      0.0      14.6     14.6       0.0   1.0      0.0    500.1     29.89             22.40       240    0.125       0      0       0.0       0.0
  L1     14/14  839.87 MB   0.0     25.6    13.6     12.0      22.6     10.5       0.0   1.7    241.7    212.7    108.67             91.90        19    5.720     26M  3130K       0.0       0.0
  L2     90/0    4.54 GB   1.8     21.1     9.2     12.0      15.9      4.0       0.6   1.7    311.6    235.1     69.43             57.30       142    0.489     21M  5280K       0.0       0.0
 Sum    120/29   6.33 GB   0.0     46.8    22.8     24.0      53.1     29.1       0.6   3.6    230.3    261.5    208.00            171.61       401    0.519     47M  8411K       0.0       0.0
 Int      0/0    0.00 KB   0.0     46.8    22.8     24.0      52.9     28.9       0.6   3.7    230.8    260.8    207.56            171.28       397    0.523     47M  8411K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     46.8    22.8     24.0      38.5     14.5       0.0   0.0    268.9    221.4    178.11            149.20       161    1.106     47M  8411K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.6     14.6       0.0   0.0      0.0    500.1     29.89             22.40       240    0.125       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 183.9 total, 180.8 interval
Flush(GB): cumulative 14.598, interval 14.355
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 53.11 GB write, 295.79 MB/s write, 46.78 GB read, 260.53 MB/s read, 208.0 seconds
Interval compaction: 52.86 GB write, 299.34 MB/s write, 46.78 GB read, 264.86 MB/s read, 207.6 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 26, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 26, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 26, total-stops: 0
interval: 26 total count
Block cache LRUCache@0x55d2cf737df0#80784 capacity: 32.00 MB seed: 1041516715 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000166 secs_since: 183
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 183.9 total, 180.8 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 82.17 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 82.17 MB/s
Cumulative stall: 00:01:9.318 H:M:S, 37.7 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14795.73 MB, 81.82 MB/s
Interval WAL: 14M writes, 0 syncs, 14691708.00 writes per sync, written: 14.45 GB, 81.82 MB/s
Interval stall: 00:01:9.318 H:M:S, 38.3 percent
Write Stall (count): write-buffer-manager-limit-stops: 0